jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_wifi_sx_ulpgn_api.c
 * Version      : 1.0
 * Description  : API functions definition for SX ULPGN of RX65N.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.01.2020 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdint.h>

#include "platform.h"
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "r_sci_rx_if.h"
#include "r_sci_rx_pinset.h"
#if defined(BSP_MCU_RX72N)
#include "../r_sci_rx/src/targets/rx72n/r_sci_rx72n_private.h"
#elif defined(BSP_MCU_RX65N)
#include "../r_sci_rx/src/targets/rx65n/r_sci_rx65n_private.h"
#elif defined(BSP_MCU_RX671)
#include "../r_sci_rx/src/targets/rx671/r_sci_rx671_private.h"
#else
#error "Include the appropriate file for your MCU."
#endif
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_bsp_common2.h"
#include "r_sci_rl_if.h"
#endif
#include "r_wifi_sx_ulpgn_private.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#if !defined(WIFI_CFG_SCI_CHANNEL)
#error "Error! Need to define WIFI_CFG_SCI_CHANNEL in r_wifi_sx_ulpgn_config.h"
#elif WIFI_CFG_SCI_CHANNEL == (0)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI0)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH0)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH0_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH0_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (1)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI1)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH1)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH1_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH1_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (2)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI2)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH2)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH2_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH2_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (3)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI3)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH3)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH3_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH3_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (4)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI4)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH4)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH4_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH4_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (5)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI5)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH5)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH5_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH5_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (6)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI6)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH6)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH6_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH6_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (7)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI7)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH7)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH7_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH7_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (8)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI8)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH8)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH8_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH8_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (9)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI9)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH9)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH9_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH9_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (10)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI10)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH10)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH10_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH10_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (11)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI11)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH11)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH11_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH11_RX_BUFSIZ)
#elif WIFI_CFG_SCI_CHANNEL == (12)
#define R_SCI_PINSET_FUNC_DEFAULT            (R_SCI_PinSet_SCI12)
#define SCI_CH_WIFI_DEFAULT                  (SCI_CH12)
#define SCI_TX_BUSIZ_DEFAULT                 (SCI_CFG_CH12_TX_BUFSIZ)
#define SCI_RX_BUSIZ_DEFAULT                 (SCI_CFG_CH12_RX_BUFSIZ)
#else
#error "Error! Invalid setting for WIFI_CFG_SCI_CHANNEL in r_wifi_sx_ulpgn_config.h"
#endif /* !definedWIFI_CFG_SCI_CHANNEL */

