jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
#if !defined(WIFI_CFG_SCI_SECOND_CHANNEL)
#error "Error! Need to define WIFI_CFG_SCI_SECOND_CHANNEL in r_bsp_config.h"
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (0)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI0)
#define SCI_CH_WIFI_SECOND                   (SCI_CH0)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH0_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH0_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (1)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI1)
#define SCI_CH_WIFI_SECOND                   (SCI_CH1)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH1_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH1_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (2)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI2)
#define SCI_CH_WIFI_SECOND                   (SCI_CH2)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH2_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH2_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (3)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI3)
#define SCI_CH_WIFI_SECOND                   (SCI_CH3)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH3_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH3_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (4)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI4)
#define SCI_CH_WIFI_SECOND                   (SCI_CH4)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH4_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH4_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (5)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI5)
#define SCI_CH_WIFI_SECOND                   (SCI_CH5)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH5_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH5_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (6)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI6)
#define SCI_CH_WIFI_SECOND                   (SCI_CH6)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH6_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH6_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (7)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI7)
#define SCI_CH_WIFI_SECOND                   (SCI_CH7)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH7_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH7_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (8)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI8)
#define SCI_CH_WIFI_SECOND                   (SCI_CH8)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH8_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH8_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (9)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI9)
#define SCI_CH_WIFI_SECOND                   (SCI_CH9)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH9_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH9_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (10)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI10)
#define SCI_CH_WIFI_SECOND                   (SCI_CH10)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH10_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH10_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (11)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI11)
#define SCI_CH_WIFI_SECOND                   (SCI_CH11)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH11_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH11_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (12)
#define R_SCI_PINSET_FUNC_SECOND             (R_SCI_PinSet_SCI12)
#define SCI_CH_WIFI_SECOND                   (SCI_CH12)
#define SCI_TX_BUSIZ_SECOND                  (SCI_CFG_CH12_TX_BUFSIZ)
#define SCI_RX_BUSIZ_SECOND                  (SCI_CFG_CH12_RX_BUFSIZ)
#elif WIFI_CFG_SCI_SECOND_CHANNEL == (-1)
#define R_SCI_PINSET_FUNC_SECOND
#define SCI_CH_WIFI_SECOND
#define SCI_TX_BUSIZ_SECOND
#define SCI_RX_BUSIZ_SECOND
#else
#error "Error! Invalid setting for WIFI_CFG_SCI_SECOND_CHANNEL in r_bsp_config.h"
#endif /* !definedWIFI_CFG_SCI_SECOND_CHANNEL */

#define ULPGN_UART_DEFAULT_PORT (0)
#define ULPGN_UART_SECOND_PORT  (1)
#define MUTEX_TX                (1 << 0)
#define MUTEX_RX                (1 << 1)
#define NULL_PTR                ((void *)0)   /* Null pointer */

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/
uint8_t g_use_uart_num = 2;

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint8_t g_wifi_createble_sockets;
uint8_t g_atcmd_port;
uint8_t g_data_port;

uint8_t g_wifi_transparent_mode = 0;

extern TaskHandle_t g_wifi_recv_task_handle;

const uint8_t g_ulpgn_socket_status_closed[] = ULPGN_SOCKET_STATUS_TEXT_CLOSED;
const uint8_t g_ulpgn_socket_status_socket[] = ULPGN_SOCKET_STATUS_TEXT_SOCKET;
const uint8_t g_ulpgn_socket_status_bound[] = ULPGN_SOCKET_STATUS_TEXT_BOUND;
const uint8_t g_ulpgn_socket_status_listen[] = ULPGN_SOCKET_STATUS_TEXT_LISTEN;
const uint8_t g_ulpgn_socket_status_connected[] = ULPGN_SOCKET_STATUS_TEXT_CONNECTED;
const uint8_t g_ulpgn_socket_status_broken[] = ULPGN_SOCKET_STATUS_TEXT_BROKEN;

const uint8_t g_ulpgn_return_dummy[] = "";

const uint32_t g_wifi_serial_buffsize_table[2][4] =
        {
                /*SCI_TX_BUSIZ_DEFAULT*//*SCI_TX_BUSIZ_SIZE*//*SCI_RX_BUSIZ_DEFAULT*//*SCI_RX_BUSIZ_SIZE*/
                /*g_wifi_using_uart_num = 1 */
                { SCI_TX_BUSIZ_DEFAULT, SCI_TX_BUSIZ_DEFAULT, SCI_RX_BUSIZ_DEFAULT, SCI_RX_BUSIZ_DEFAULT },
                /*g_wifi_using_uart_num = 2 */
                { SCI_TX_BUSIZ_SECOND, SCI_TX_BUSIZ_DEFAULT, SCI_TX_BUSIZ_SECOND, SCI_RX_BUSIZ_DEFAULT }
        };

const uint8_t *const gp_wifi_socket_status_tbl[ULPGN_SOCKET_STATUS_MAX] =
    {
        g_ulpgn_socket_status_closed,
        g_ulpgn_socket_status_socket,
        g_ulpgn_socket_status_bound,
        g_ulpgn_socket_status_listen,
        g_ulpgn_socket_status_connected,
        g_ulpgn_socket_status_broken,
    };

volatile uint8_t g_current_socket_index;
volatile uint8_t g_before_socket_index;

