jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
st_cert_profile_t g_cert_profile[5];
#else
st_cert_profile_t g_cert_profile[2];
#endif

/* Wifi Execute Command Timeout */
uint16_t g_atcmd_timeout1 = EXECUTE_COMMAND_TIMEOUT_DEFAULT1;
uint16_t g_atcmd_timeout2 = EXECUTE_COMMAND_TIMEOUT_DEFAULT2;
uint16_t g_atcmd_timeout3 = EXECUTE_COMMAND_TIMEOUT_DEFAULT3;
uint16_t g_atcmd_timeout4 = EXECUTE_COMMAND_TIMEOUT_DEFAULT4;
uint16_t g_atcmd_timeout5 = EXECUTE_COMMAND_TIMEOUT_DEFAULT5;

wifi_system_status_t g_wifi_system_state = WIFI_SYSTEM_CLOSE;
uint8_t g_wifi_atcmd_buf[WIFI_AT_COMMAND_BUFF_SIZE];
uint8_t g_wifi_resp_buf[WIFI_AT_RESPONSE_BUFF_SIZE];

st_atcmd_info_t g_wifi_uart[WIFI_NUMBER_OF_USE_UART];

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;
uint32_t g_wifi_sci_err_flag;


/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
static int32_t wifi_execute_at_command (uint8_t serial_ch_id, const uint8_t  SCI_FAR* ptextstring, uint16_t timeout_ms,
        wifi_return_code_t expect_code, wifi_command_list_t command, int32_t socket_number);

static int32_t wifi_take_mutex (uint8_t mutex_flag);
static int32_t wifi_take_atc_mutex(uint8_t mutex_flag);
static void wifi_give_mutex (uint8_t mutex_flag);
static void wifi_give_atc_mutex (uint8_t mutex_flag);

static void wifi_uart_callback_second_port_for_command (void * pArgs);
static void wifi_uart_callback_default_port_for_inititial (void * pArgs);
static void wifi_uart_callback_default_port_for_data (void * pArgs);
static void timeout_init (int32_t serial_ch, uint16_t timeout_ms);
static int32_t check_timeout (int32_t serial_ch, int32_t rcvcount);
static void socket_timeout_init (uint8_t socket_number, uint32_t timeout_ms, uint8_t flag);
static int32_t socket_check_timeout (uint8_t socket_number, uint8_t flag);

static int32_t wifi_get_ipaddress (void);
static int32_t wifi_serial_open_for_initial (void);
static int32_t wifi_serial_open_for_data (void);
static int32_t wifi_serial_default_port_close (void);
static int32_t wifi_change_command_mode (void);
static int32_t wifi_change_transparent_mode (void);
static int32_t wifi_serial_second_port_open (void);
static int32_t wifi_serial_second_port_close (void);
static int32_t wifi_check_uart_state (uint32_t * uart_receive_status, uint32_t * uart_send_status);

static int32_t wifi_serial_close (void);

static int32_t wifi_get_socket_status (uint8_t socket_number);
static int32_t wifi_change_socket_index (uint8_t socket_number);
static wifi_err_t wifi_setsslconfiguration (int32_t socket_number, uint8_t ssl_type);
static uint32_t erase_certificate (uint8_t * certificate_name);

/**
 * @brief The global mutex to ensure that only one operation is accessing the
 * s_wifi_tx_semaphore flag at one time.
 */
static SemaphoreHandle_t s_wifi_tx_semaphore = NULL;
static SemaphoreHandle_t s_wifi_rx_semaphore = NULL;
static SemaphoreHandle_t s_wifi_atc_tx_semaphore = NULL;
static SemaphoreHandle_t s_wifi_atc_rx_semaphore = NULL;

/**
 * @brief Maximum time in ticks to wait for obtaining a semaphore.
 */
static const TickType_t s_xMaxSemaphoreBlockTime = pdMS_TO_TICKS(ULPGN_CFG_SEMAPHORE_BLOCK_TIME);

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Open
 * Description  : WiFi Module Open.
 * Arguments    : none.
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_SERIAL_OPEN
 *                WIFI_ERR_SOCKET_BYTEQ
 *                WIFI_ERR_ALREADY_OPEN
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Open(void)
{
    int32_t ret;
    sci_baud_t change_baud;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t open_phase;
    uint8_t byteq_open_count;
    int32_t k;

    if (WIFI_SYSTEM_CLOSE != g_wifi_system_state)
    {
        return WIFI_ERR_ALREADY_OPEN;
    }

    /* Memory initialize */
    g_atcmd_port = WIFI_UART_COMMAND_PORT;
    memset(g_wifi_uart, 0, sizeof(g_wifi_uart));
    g_wifi_uart[WIFI_UART_COMMAND_PORT].p_cmdbuf     = g_wifi_atcmd_buf;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].cmdbuf_size  = sizeof(g_wifi_atcmd_buf);
    g_wifi_uart[WIFI_UART_COMMAND_PORT].p_respbuf    = g_wifi_resp_buf;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].respbuf_size = sizeof(g_wifi_resp_buf);
    g_wifi_uart[WIFI_UART_DATA_PORT].p_cmdbuf        = g_wifi_atcmd_buf;
    g_wifi_uart[WIFI_UART_DATA_PORT].cmdbuf_size     = sizeof(g_wifi_atcmd_buf);
    g_wifi_uart[WIFI_UART_DATA_PORT].p_respbuf       = g_wifi_resp_buf;
    g_wifi_uart[WIFI_UART_DATA_PORT].respbuf_size    = sizeof(g_wifi_resp_buf);
    g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
    g_wifi_tx_busiz_data = g_wifi_serial_buffsize_table[0][0];
    g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][1];
    g_wifi_rx_busiz_data = g_wifi_serial_buffsize_table[0][1];

    memset(g_wifi_socket, 0, sizeof(g_wifi_socket));
    wifi_init_at_execute_queue();
    open_phase = 0;

    /* Phase 1: ByteQ initialize */
    for (byteq_open_count = 0; byteq_open_count < WIFI_CFG_CREATABLE_SOCKETS; byteq_open_count++ )
    {
        if (BYTEQ_SUCCESS != R_BYTEQ_Open(g_wifi_socket[byteq_open_count].socket_recv_buff,
                sizeof(g_wifi_socket[byteq_open_count].socket_recv_buff),
                &g_wifi_socket[byteq_open_count].socket_byteq_hdl))
        {
            break;
        }
    }

    if (WIFI_CFG_CREATABLE_SOCKETS >= byteq_open_count)
    {
        /* Success */
        open_phase |= 0x01;
    }
    else
    {
        api_ret = WIFI_ERR_BYTEQ_OPEN;
    }

