jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SUCCESS == api_ret)
    {
        /* Phase 3 Semaphore tx initialize */
        if (NULL != s_wifi_tx_semaphore)
        {
            /* tx semaphore */
            vSemaphoreDelete(s_wifi_tx_semaphore);
        }
        s_wifi_tx_semaphore = xSemaphoreCreateMutex();

        if (NULL != s_wifi_atc_tx_semaphore)
        {
            /* tx semaphore */
            vSemaphoreDelete(s_wifi_atc_tx_semaphore);
        }
        s_wifi_atc_tx_semaphore = xSemaphoreCreateMutex();

        if ((NULL != s_wifi_tx_semaphore) && (NULL != s_wifi_atc_tx_semaphore))
        {
            /* Success */
            open_phase |= 0x02;
        }
        else
        {
            api_ret = WIFI_ERR_TAKE_MUTEX;
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        /* Phase 4 Semaphore rx initialize */
        if (NULL != s_wifi_rx_semaphore)
        {
            /* rx semaphore */
            vSemaphoreDelete(s_wifi_rx_semaphore);
        }
        s_wifi_rx_semaphore = xSemaphoreCreateMutex();

        if (NULL != s_wifi_atc_rx_semaphore)
        {
            /* rx semaphore */
            vSemaphoreDelete(s_wifi_atc_rx_semaphore);
        }
        s_wifi_atc_rx_semaphore = xSemaphoreCreateMutex();

        if ((NULL != s_wifi_rx_semaphore) && (NULL != s_wifi_atc_rx_semaphore))
        {
            /* Success */
            open_phase |= 0x04;
        }
        else
        {
            api_ret = WIFI_ERR_TAKE_MUTEX;
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        /* Phase 4 Serial initialize */
        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
        WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
#endif

        vTaskDelay(26);
        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
        vTaskDelay(250);

        ret = wifi_serial_open_for_initial();
        if (0 == ret)
        {
            /* Success */
            open_phase |= 0x08;
        }
        else
        {
            api_ret = WIFI_ERR_SERIAL_OPEN;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        ret = wifi_serial_second_port_open();
        if (0 == ret)
        {
            /* Success */
            open_phase |= 0x10;
        }
        else
        {
            api_ret = WIFI_ERR_SERIAL_OPEN;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Phase 5 Task initialize */
        if (0 == wifi_start_recv_task())
        {
            vTaskDelay(2);

            /* Success */
            open_phase |= 0x20;
        }
        else
        {
            api_ret = WIFI_ERR_SERIAL_OPEN;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* no echo */
        ret = wifi_execute_at_command(g_atcmd_port, "ATE0\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        /* no echo */
        ret = wifi_execute_at_command(g_atcmd_port, "ATWREV\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MODULE_VERSION, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Command Port = HSUART2 */
        ret = wifi_execute_at_command(g_atcmd_port, "ATUART=2\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_2, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
        else
        {
            vTaskDelay(1000); /* 1 sec */
            g_atcmd_port = ULPGN_UART_SECOND_PORT;
            wifi_serial_default_port_close();
            open_phase &= (~0x08);
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        /* Command Port = HSUART2, Data Port = HSUART1 */
        ret = wifi_execute_at_command(g_atcmd_port, "ATE0\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
        if (0 == ret)
        {
            /* Multiple Connection */
            /* Change HSUART1 baudrate and flow control. */
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
            /* AT command */
            sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATBX1=%lu,,,,h\r", WIFI_CFG_SCI_BAUDRATE);
#else
            sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATBX1=%lu,,,,\r", WIFI_CFG_SCI_BAUDRATE);
#endif
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
            if (WIFI_SUCCESS == api_ret)
            {
                ret = wifi_serial_open_for_data();
                if (0 == ret)
                {
                    open_phase |= 0x08;
                }
                else
                {
                    api_ret = WIFI_ERR_SERIAL_OPEN;
                }
            }
            if (WIFI_SUCCESS == api_ret)
            {
                R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
                WIFI_RTS_DDR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
#endif
                vTaskDelay(1000);

                ret = wifi_execute_at_command(g_atcmd_port, "ATUART=2,1\r", g_atcmd_timeout1,
                        WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_21, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                }
            }
            if (WIFI_SUCCESS == api_ret)
            {
                vTaskDelay(1000); /* 1 sec */

                g_use_uart_num = 2;
                g_wifi_createble_sockets = WIFI_CFG_CREATABLE_SOCKETS;
                g_atcmd_port = ULPGN_UART_SECOND_PORT;
                g_data_port = ULPGN_UART_DEFAULT_PORT;
                g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[1][0];
                g_wifi_tx_busiz_data = g_wifi_serial_buffsize_table[1][1];
                g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[1][2];
                g_wifi_rx_busiz_data = g_wifi_serial_buffsize_table[1][3];
            }
        }
        else
        {
            /* Single Connection */
            ret = wifi_serial_second_port_close();
            open_phase &= (~0x10);

