jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
            wifi_init_at_execute_queue();
            g_use_uart_num = 1;
            g_wifi_createble_sockets = 1;
            g_atcmd_port = ULPGN_UART_DEFAULT_PORT;
            g_data_port = ULPGN_UART_DEFAULT_PORT;
            g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
            g_wifi_tx_busiz_data = g_wifi_serial_buffsize_table[0][1];
            g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][2];
            g_wifi_rx_busiz_data = g_wifi_serial_buffsize_table[0][3];

            /* Wifi Module hardware reset   */
            WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
            WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
#endif
            vTaskDelay(26);
            WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
            vTaskDelay(200);

            ret = wifi_serial_open_for_initial();
            if (0 == ret)
            {
                open_phase |= 0x10;
            }
            else
            {
                api_ret = WIFI_ERR_SERIAL_OPEN;
            }
            if (WIFI_SUCCESS == api_ret)
            {
                /* no echo */
                ret = wifi_execute_at_command(g_atcmd_port, "ATE0\r", g_atcmd_timeout1,
                        WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                }
            }
            if (WIFI_SUCCESS == api_ret)
            {
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
                /* Change HSUART1 baudrate and flow control. */
                sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATBX1=%lu,,,,h\r", WIFI_CFG_SCI_BAUDRATE);
#endif
#else
                sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATBX1=%lu,,,,\r", WIFI_CFG_SCI_BAUDRATE);
#endif
                ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                }
            }
            if (WIFI_SUCCESS == api_ret)
            {
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
                change_baud.pclk = g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle->pclk_speed;
                change_baud.rate = WIFI_CFG_SCI_BAUDRATE;
                R_SCI_Control(g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle, SCI_CMD_CHANGE_BAUD, &change_baud);
                R_SCI_Control(g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
                WIFI_RTS_DDR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
//                change_baud.pclk = g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle->pclk_speed;
                change_baud.rate = WIFI_CFG_SCI_BAUDRATE;
                R_SCI_Control (g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle, SCI_CMD_CHANGE_BAUD, &change_baud);
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#endif

                vTaskDelay(1000);
            }
        }

    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* UART transmission flow control busy retry timeout */
        ret = wifi_execute_at_command(g_atcmd_port, "ATS108=1\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_FLOW_TIMEOUT, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Escape guard time = 200msec */
        ret = wifi_execute_at_command(g_atcmd_port, "ATS12=1\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ESCAPE_GUARD_TIME, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Buffer size = 1420byte */
        ret = wifi_execute_at_command(g_atcmd_port, "ATBSIZE=1420\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_BUFFER_THRESHOLD, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Disconnect from currently connected Access Point, */
        ret = wifi_execute_at_command(g_atcmd_port, "ATWD\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
        else
        {
            g_current_socket_index = 0;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Receive timeout  */
        ret = wifi_execute_at_command(g_atcmd_port, "ATTO=1\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AT_RECV_TIMEOUT, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Receive timeout  */
        ret = wifi_execute_at_command(g_atcmd_port, "ATS110=1\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTOCLOSE, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* Receive timeout  */
        ret = wifi_execute_at_command(g_atcmd_port, "ATS105=0\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        g_wifi_system_state = WIFI_SYSTEM_OPEN;
    }
    else
    {
        if (0 != (open_phase & 0x10))
        {
            wifi_serial_second_port_close();
        }
        if (0 != (open_phase & 0x08))
        {
            wifi_serial_default_port_close();
        }
        if (0 != (open_phase & 0x20))
        {
            wifi_delete_recv_task();
        }
        if (0 != (open_phase & 0x04))
        {
            /* delete WiFi RX Semaphore */
            vSemaphoreDelete(s_wifi_rx_semaphore);
            s_wifi_rx_semaphore = NULL;
        }
        if (0 != (open_phase & 0x02))
        {
            /* delete WiFi TX Semaphore */
            vSemaphoreDelete(s_wifi_tx_semaphore);
            s_wifi_tx_semaphore = NULL;
        }
        if (0 != (open_phase & 0x01))
        {
            for (k = 0; k < byteq_open_count; k++ )
            {
                R_BYTEQ_Close(g_wifi_socket[k].socket_byteq_hdl);
            }
        }
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Open
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Close
 * Description  : WiFi Module Close.
 * Arguments    : none.
 * Return Value : WIFI_SUCCESS
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Close(void)
{
    uint16_t i;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if (0 == R_WIFI_SX_ULPGN_IsConnected())
    {
        R_WIFI_SX_ULPGN_Disconnect();
    }
    wifi_serial_close();
    wifi_delete_recv_task();
    for (i = 0; i < WIFI_CFG_CREATABLE_SOCKETS; i++ )
    {
        R_BYTEQ_Close(g_wifi_socket[i].socket_byteq_hdl);
    }
    g_wifi_system_state = WIFI_SYSTEM_CLOSE;

    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_SetDnsServerAddress
 * Description  : Set DNS Server Address.
 * Arguments    : dns_address1 - First DNS address
 *                dns_address2 - Second DNS address
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_SetDnsServerAddress(uint32_t dns_address1, uint32_t dns_address2)
{
    int32_t ret;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t mutex_flag;
    uint8_t * p_cbuff = g_wifi_uart[g_atcmd_port].p_cmdbuf;

