jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        wifi_change_command_mode();
        if (0 != dns_address1)
        {
            /* set dns address1 */
            sprintf((char *) p_cbuff, "ATNDNSSVR1=%d.%d.%d.%d\r",
                    WIFI_ULONG_TO_IPV4BYTE_1(dns_address1), /* addr1 */
                    WIFI_ULONG_TO_IPV4BYTE_2(dns_address1), /* addr2 */
                    WIFI_ULONG_TO_IPV4BYTE_3(dns_address1), /* addr3 */
                    WIFI_ULONG_TO_IPV4BYTE_4(dns_address1)); /* addr4 */
            ret = wifi_execute_at_command(g_atcmd_port, p_cbuff, g_atcmd_timeout1,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        if (0 != dns_address2)
        {
            /* set dns address2 */
            sprintf((char *) p_cbuff, "ATNDNSSVR2=%d.%d.%d.%d\r",
                    WIFI_ULONG_TO_IPV4BYTE_1(dns_address2), /* addr1 */
                    WIFI_ULONG_TO_IPV4BYTE_2(dns_address2), /* addr2 */
                    WIFI_ULONG_TO_IPV4BYTE_3(dns_address2), /* addr3 */
                    WIFI_ULONG_TO_IPV4BYTE_4(dns_address2)); /* addr4 */
            ret = wifi_execute_at_command(g_atcmd_port, p_cbuff, g_atcmd_timeout1,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
        }
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;

}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_SetDnsServerAddress
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Connect
 * Description  : WiFi module connect to Access Point.
 * Arguments    : ssid
 *                pass
 *                security
 *                dhcp_enable
 *                ip_config
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Connect(const uint8_t * ssid, const uint8_t * pass,
        uint32_t security, uint8_t dhcp_enable, wifi_ip_configuration_t * ip_config)
{
    int32_t ret;
    uint8_t mutex_flag;
    uint8_t security_type;
    uint8_t retry_count;
    uint8_t getip_retry_count;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t * p_cbuff = g_wifi_uart[g_atcmd_port].p_cmdbuf;

    if ((NULL == ssid) || (NULL == pass) || ((WIFI_SECURITY_WPA != security) && (WIFI_SECURITY_WPA2 != security))
            || (NULL == ip_config))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }
    if (0 == R_WIFI_SX_ULPGN_IsConnected())
    {
        /* Nothing to do. */
        return WIFI_SUCCESS;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        if (0 == dhcp_enable)
        {
            /* DHCP Not Use */
            ret = wifi_execute_at_command(g_atcmd_port, "ATNDHCP=0\r", g_atcmd_timeout1,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
            if (WIFI_SUCCESS == api_ret)
            {
                /* AT command */
                sprintf((char *)p_cbuff, "ATNSET=%d.%d.%d.%d,%d.%d.%d.%d,%d.%d.%d.%d\r\n",
                        WIFI_ULONG_TO_IPV4BYTE_1(ip_config->ipaddress),  /* addr1 */
                        WIFI_ULONG_TO_IPV4BYTE_2(ip_config->ipaddress),  /* addr2 */
                        WIFI_ULONG_TO_IPV4BYTE_3(ip_config->ipaddress),  /* addr3 */
                        WIFI_ULONG_TO_IPV4BYTE_4(ip_config->ipaddress),  /* addr4 */
                        WIFI_ULONG_TO_IPV4BYTE_1(ip_config->subnetmask), /* addr1 */
                        WIFI_ULONG_TO_IPV4BYTE_2(ip_config->subnetmask), /* addr2 */
                        WIFI_ULONG_TO_IPV4BYTE_3(ip_config->subnetmask), /* addr3 */
                        WIFI_ULONG_TO_IPV4BYTE_4(ip_config->subnetmask), /* addr4 */
                        WIFI_ULONG_TO_IPV4BYTE_1(ip_config->gateway),    /* addr1 */
                        WIFI_ULONG_TO_IPV4BYTE_2(ip_config->gateway),    /* addr2 */
                        WIFI_ULONG_TO_IPV4BYTE_3(ip_config->gateway),    /* addr3 */
                        WIFI_ULONG_TO_IPV4BYTE_4(ip_config->gateway));   /* addr4 */

                /* Set Static IP address */
                ret = wifi_execute_at_command(g_atcmd_port, p_cbuff, g_atcmd_timeout1,
                        WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_STATIC_IP, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                }
            }
        }
        else
        {
            /* DHCP Use */
            ret = wifi_execute_at_command(g_atcmd_port, "ATNDHCP=1\r", g_atcmd_timeout1,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        if (0 == R_WIFI_SX_ULPGN_IsConnected())
        {
            /* If Wifi is already connected, do nothing and return fail. */
            wifi_give_mutex(mutex_flag);
            if (0 != R_WIFI_SX_ULPGN_Disconnect())
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
            if (WIFI_SUCCESS == api_ret)
            {
                if (0 != wifi_take_mutex(mutex_flag))
                {
                    api_ret = WIFI_ERR_TAKE_MUTEX;
                }
            }
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        vTaskDelay(2000);

        if (WIFI_SECURITY_WPA == security)
        {
            security_type = 1;
        }
        else
        {
            security_type = 2;
        }

        for (retry_count = 0; retry_count < 3; retry_count++ )
        {
            /* AT command */
            sprintf((char *)p_cbuff, "ATWAWPA=%s,%d,1,1,%s\r", ssid, security_type, pass);
            ret = wifi_execute_at_command(g_atcmd_port, p_cbuff, g_atcmd_timeout1 * 2,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_CONNECT, 0xff);
            if ((0 == ret) || ((-2) == ret))
            {
                if ((-2) == ret)
                {
                    memset(g_wifi_current_ssid, 0, sizeof(g_wifi_current_ssid));
                    ret = wifi_execute_at_command(g_atcmd_port, "ATW\r", g_atcmd_timeout2,
                            WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_CURRENT_SSID, 0xff);
                    if (0 == ret)
                    {
                        ret = -1;
                        if (0 == strcmp((const char *)g_wifi_current_ssid, (const char *)ssid)) /* ssid */
                        {
                            ret = 0;
                        }
                    }
                }
            }
            if (0 != ret)
            {
                wifi_execute_at_command(g_atcmd_port, "ATWD\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                        WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
            }
            else
            {
                break;
            }
        }
        if (retry_count >= 3)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        if (0 != dhcp_enable)
        {
            for (getip_retry_count = 0; getip_retry_count < 10; getip_retry_count++ )
            {
                vTaskDelay(3000);
                ret = wifi_get_ipaddress();
                if ((0 == ret) && (0 != g_wifi_ipconfig.ipaddress))
                {
                    memcpy(ip_config, &g_wifi_ipconfig, sizeof(wifi_ip_configuration_t));
                    break;
                }
            }
            if (0 == g_wifi_ipconfig.ipaddress)
            {
                wifi_execute_at_command(g_atcmd_port, "ATWD\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                        WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
                api_ret = WIFI_ERR_MODULE_COM;
            }
        }
    }

