jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SUCCESS == api_ret)
    {
        g_wifi_system_state = WIFI_SYSTEM_CONNECT;
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Connect
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Disconnect
 * Description  : WiFi Module disconnect from Access Point.
 * Arguments    : none.
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Disconnect(void)
{
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }
    if (WIFI_SYSTEM_OPEN == g_wifi_system_state)
    {
        /* Nothing to do. */
        return WIFI_SUCCESS;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        wifi_change_command_mode();
        wifi_execute_at_command(g_atcmd_port, "ATWD\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
        memset( &g_wifi_ipconfig, 0, sizeof(g_wifi_ipconfig));
        g_wifi_system_state = WIFI_SYSTEM_OPEN;
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }

    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Disconnect
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_IsConnected
 * Description  : Check connected Status.
 * Arguments    : none.
 * Return Value : 0  - connected
 *                -1 - not connected
 *********************************************************************************************************************/
int32_t R_WIFI_SX_ULPGN_IsConnected(void)
{
    int32_t ret = -1;

    if (WIFI_SYSTEM_CONNECT == g_wifi_system_state)
    {
        ret = 0;
    }
    return ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_IsConnected
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_GetMacAddress
 * Description  : Get WiFi module MAC Address.
 * Arguments    : mac_address.
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_GetMacAddress(uint8_t * mac_address)
{
    int32_t ret;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if (NULL == mac_address)
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }
    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }

    if (WIFI_SUCCESS == api_ret)
    {
        ret = wifi_execute_at_command(g_atcmd_port, "ATW\r\n", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_GET_MACADDRESS, 0xff);
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
        memcpy(mac_address, g_wifi_macaddress, sizeof(g_wifi_macaddress));
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_GetMacAddress
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_GetIpAddress
 * Description  : Get WiFi module IP Address.
 * Arguments    : ip_config.
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_GetIpAddress(wifi_ip_configuration_t * ip_config)
{
    int32_t ret;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if (NULL == ip_config)
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }

    if (WIFI_SUCCESS == api_ret)
    {
        ret = wifi_get_ipaddress();
        if (0 != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        memcpy(ip_config, &g_wifi_ipconfig, sizeof(wifi_ip_configuration_t));
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_GetIpAddress
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Scan
 * Description  : Scan Access points.
 * Arguments    : ap_results
 *                max_networks
 *                exist_ap_list
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Scan(wifi_scan_result_t * ap_results, uint32_t max_networks, uint32_t * exist_ap_list)
{
    int32_t i;
    int32_t ret;
    uint8_t retry_count;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == ap_results) || (0 == max_networks) || (NULL == exist_ap_list))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        gp_wifi_ap_results = ap_results;
        g_wifi_aplistmax = max_networks;
        g_wifi_aplist_stored_num = 0;
        g_wifi_aplist_count = 0;
        g_wifi_aplist_subcount = 0;
        memset(gp_wifi_ap_results, 0x00, sizeof(wifi_scan_result_t) * max_networks);
        for (i = 0; i < max_networks; i++ )
        {
            gp_wifi_ap_results[i].security = WIFI_SECURITY_UNDEFINED;
        }

