jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
        for (retry_count = 0; retry_count < 5; retry_count++ )
        {
            ret = wifi_execute_at_command(g_atcmd_port, "ATWS\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                    WIFI_COMMAND_GET_APLIST, 0xff);
            if (0 == ret)
            {
                *exist_ap_list = g_wifi_aplist_count;
                break;
            }
            vTaskDelay(1);
        }
        if (retry_count >= 5)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }

    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Scan
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_GetTcpSocketStatus
 * Description  : Get TCP socket status.
 * Arguments    : socket_number
 * Return Value : -1    - not exist
 *                other - socket table pointer
 *********************************************************************************************************************/
int32_t R_WIFI_SX_ULPGN_GetTcpSocketStatus(uint8_t socket_number)
{
    if (socket_number >= g_wifi_createble_sockets)
    {
        return -1;
    }
    wifi_get_socket_status(socket_number);
    return g_wifi_socket_status;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_GetTcpSocketStatus
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_CreateSocket
 * Description  : Create TCP socket.
 * Arguments    : type
 *                ip_version
 * Return Value : Positive number - created socket number
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_SOCKET_CREATE
 *********************************************************************************************************************/
int32_t R_WIFI_SX_ULPGN_CreateSocket(uint32_t type, uint32_t ip_version)
{
    int32_t i;
    int32_t ret = WIFI_ERR_SOCKET_CREATE;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint32_t atustat_recv;

    mutex_flag = (MUTEX_TX | MUTEX_RX);

    if ((WIFI_SOCKET_IP_PROTOCOL_TCP != type) || (WIFI_SOCKET_IP_VERSION_4 != ip_version))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

    if (0 != wifi_take_mutex(mutex_flag))
    {
        return WIFI_ERR_TAKE_MUTEX;
    }

    if (WIFI_SUCCESS == api_ret)
    {
        for (i = 0; i < g_wifi_createble_sockets; i++ )
        {
            if (0 == g_wifi_socket[i].socket_create_flag)
            {
                break;
            }
        }
        if (i >= g_wifi_createble_sockets)
        {
            api_ret = WIFI_ERR_SOCKET_NUM;
        }
    }

    if (WIFI_SUCCESS == api_ret)
    {
        if (g_current_socket_index == i)
        {
            if (0 != wifi_check_uart_state(&atustat_recv, &g_wifi_socket[i].start_processed_data_size))
            {
                api_ret = WIFI_ERR_MODULE_COM;
            }
        }
        else
        {
            g_wifi_socket[i].start_processed_data_size = 0;
        }

        if (WIFI_SUCCESS == api_ret)
        {
            g_wifi_socket[i].socket_create_flag = 1;
            g_wifi_socket[i].ipversion = (uint8_t)ip_version; /* ip_version */
            g_wifi_socket[i].protocol =  (uint8_t)type;       /* type */
            g_wifi_socket[i].socket_status = WIFI_SOCKET_STATUS_SOCKET;
            g_wifi_socket[i].ssl_flag = 0;
            g_wifi_socket[i].ssl_type = 0;
            g_wifi_socket[i].ssl_certificate_id = 0;
            g_wifi_socket[i].timeout_count = 0;
            g_wifi_socket[i].extracted_data_size = 0;
            g_wifi_socket[i].total_data_size = 0;
            g_wifi_socket[i].processed_data_size = 0;
            g_wifi_socket[i].end_processed_data_size = 0;
            R_BYTEQ_Flush(g_wifi_socket[i].socket_byteq_hdl);
            ret = i;
        }
    }
    else
    {
        ret = WIFI_ERR_SOCKET_CREATE;
    }

    /* Give back the socketInUse mutex. */
    wifi_give_mutex(mutex_flag);

    return ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_CreateSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_sx_ulpgn_get_host_by_name
 * Description  : Get IP address by host name.
 * Arguments    : pcHostName
 * Return Value : Same as R_WIFI_SX_ULPGN_DnsQuery()
 *********************************************************************************************************************/
uint32_t r_sx_ulpgn_get_host_by_name(const char * pcHostName)
{
    uint32_t ulAddr = 0;

    /* DnsQuery */
    R_WIFI_SX_ULPGN_DnsQuery((uint8_t *)pcHostName, &ulAddr);
    return ulAddr;
}
/**********************************************************************************************************************
 * End of function r_sx_ulpgn_get_host_by_name
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_ConnectSocket
 * Description  : Get host by name.
 * Arguments    : socket_number
 *                ip_address
 *                port
 *                destination
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *                WIFI_ERR_NOT_CONNECT
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_ConnectSocket(int32_t socket_number, uint32_t ip_address, uint16_t port, char * destination)
{
    int32_t ret;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t certificate_count;

    wifi_certificate_infomation_t * p_cert_info;
    wifi_certificate_infomation_t cert_info;
    char certificate_file[32];
    char calist_file[32];
    uint8_t certificate_flg = 0;
    uint8_t calist_flg = 0;
    uint16_t hostAddr_matched;

    /* certificate information */
    p_cert_info = (wifi_certificate_infomation_t *) &cert_info;

    if ((0 == ip_address) || (0 == port))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0)
            || (WIFI_SOCKET_STATUS_SOCKET != g_wifi_socket[socket_number].socket_status))
    {
        return WIFI_ERR_SOCKET_NUM;
    }

    if (1 == g_wifi_socket[socket_number].ssl_flag)
    {
        hostAddr_matched = 0;

        for (certificate_count = 0; certificate_count <
        (sizeof((st_cert_profile_t *)g_cert_profile));
                certificate_count++ )
        {
            if (ip_address == g_cert_profile[certificate_count].host_address)
            {
                g_wifi_socket[socket_number].ssl_certificate_id = certificate_count;
                hostAddr_matched = 1;
                break;
            }
            else if ('\0' != g_cert_profile[certificate_count].host_name[0])
            {
                if (r_sx_ulpgn_get_host_by_name(g_cert_profile[certificate_count].host_name) == ip_address)
                {
                    g_wifi_socket[socket_number].ssl_certificate_id = certificate_count;
                    hostAddr_matched = 1;
                    break;
                }
            }
            else
            {
                ; /* Do nothing */
            }
        }

        if (0 == hostAddr_matched)
        {
            printf("do not match host address.(%lu)\r\n", ip_address);
        }

        api_ret = R_WIFI_SX_ULPGN_GetServerCertificate(p_cert_info);
    }
    if (WIFI_SUCCESS != api_ret)
    {
        return api_ret;
    }
    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
        return api_ret;
    }

