jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SUCCESS == api_ret)
    {
        if (2 == g_use_uart_num)
        {
            /* socket index */
            ret = wifi_change_socket_index((uint8_t)socket_number);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_CHANGE_SOCKET;
            }
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        vTaskDelay(200);
        if (1 == g_wifi_socket[socket_number].ssl_flag)
        {
            /* certificate file */
            sprintf((char *)certificate_file, "cert%d.crt", g_wifi_socket[socket_number].ssl_certificate_id);

            /* calist */
            sprintf((char *)calist_file, "calist%d.crt", g_wifi_socket[socket_number].ssl_certificate_id);

            /* exist certificate file */
            while (0 != p_cert_info->certificate_file[0])
            {
                /* certificate file */
                if (0 == strcmp((char *)(p_cert_info->certificate_file), (char *)certificate_file))
                {
                    certificate_flg = 1;
                }

                /* calist file */
                if (0 == strcmp((char *)(p_cert_info->certificate_file), (char *)calist_file))
                {
                    calist_flg = 1;
                }
                if ((1 == certificate_flg) & (1 == calist_flg))
                {
                    break;
                }
                p_cert_info = p_cert_info->next_certificate_name;
            }

            /* AT command */
            sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSOCK=%d,%d\r", 2, 4);
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CREATE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_SOCKET_CREATE;
            }

            /* Receive timeout  */
            ret = wifi_execute_at_command(g_atcmd_port, "ATNSSL=2,1\r", g_atcmd_timeout1,
                    WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
                printf("ATNSSL ERROR\r\n");
            }

            if (1 == calist_flg)
            {
                /* calist */
                sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLLD=2,%s,2\r", (char *)calist_file);
                ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                    printf("ATNSSLLD_CA ERROR\r\n");
                }
            }
            if (1 == certificate_flg)
            {
                /* certificate file */
                sprintf((char *) g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLLD=2,%s,1\r",
                        (char *) certificate_file);
                ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
                if (0 != ret)
                {
                    api_ret = WIFI_ERR_MODULE_COM;
                    printf("ATNSSLLS_CERT ERROR\r\n");
                }
            }
            if (NULL_PTR != destination)
            {
                /* destination */
                sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLCFG=2,4,%s,0,1\r", destination);
            }
            else
            {
                /* destination */
                sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLCFG=2,4,,0,1\r");
            }
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_MODULE_COM;
                printf("ATNSSLCFG ERROR\r\n");
            }
        }
        else
        {
            /* AT command */
            sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSOCK=%d,%d\r", 0, 4);
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CREATE, 0xff);
            if (0 != ret)
            {
                api_ret = WIFI_ERR_SOCKET_CREATE;
            }
        }

    }

    if (WIFI_SUCCESS == api_ret)
    {
        /* AT command */
        sprintf((char *) g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNCTCP=%u.%u.%u.%u,%u\r",
                WIFI_ULONG_TO_IPV4BYTE_1(ip_address),  /* addr1 */
                WIFI_ULONG_TO_IPV4BYTE_2(ip_address),  /* addr2 */
                WIFI_ULONG_TO_IPV4BYTE_3(ip_address),  /* addr3 */
                WIFI_ULONG_TO_IPV4BYTE_4(ip_address),  /* addr4 */
                port);
        if (2 == g_use_uart_num)
        {
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout5, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_number);
        }
        else
        {
            ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                    g_atcmd_timeout5, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_number);
        }
        if (0 != ret)
        {
            wifi_execute_at_command(g_atcmd_port, "ATNCLOSE\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                    WIFI_COMMAND_SET_SOCKET_CLOSE, socket_number);
            vTaskDelay(500);
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    else
    {
        wifi_execute_at_command(g_atcmd_port, "ATNCLOSE\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_SET_SOCKET_CLOSE, socket_number);
        vTaskDelay(500);
        api_ret = WIFI_ERR_MODULE_COM;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        g_wifi_socket[socket_number].socket_status = WIFI_SOCKET_STATUS_CONNECTED;
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }

    return api_ret;

