jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_ConnectSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_SendSocket
 * Description  : Send data on connecting socket.
 * Arguments    : socket_number
 *                data
 *                length
 *                timeout_ms
 * Return Value : Positive number - number of sent data
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
int32_t R_WIFI_SX_ULPGN_SendSocket(int32_t socket_number, uint8_t SCI_FAR* data, int32_t length, uint32_t timeout_ms)
{
    volatile int32_t timeout;
    volatile int32_t sended_length;
    int32_t current_send_length;
    int32_t ret;
    sci_err_t ercd;
    int32_t api_ret = 0;

    if ((NULL == data) || (length < 0))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0)
            || (0 == g_wifi_socket[socket_number].socket_create_flag)
            || (WIFI_SOCKET_STATUS_CONNECTED != g_wifi_socket[socket_number].socket_status))
    {
        return WIFI_ERR_SOCKET_NUM;
    }

    if (0 == wifi_take_mutex(MUTEX_TX))
    {
        sended_length = 0;

        if (2 == g_use_uart_num)
        {
            if (socket_number != g_current_socket_index)
            {
                if (0 != wifi_take_atc_mutex(MUTEX_TX | MUTEX_RX))
                {
                    return WIFI_ERR_TAKE_MUTEX;
                }
                ret = wifi_change_socket_index((uint8_t)socket_number); /* socket number */
                wifi_give_atc_mutex(MUTEX_TX | MUTEX_RX);
                if (0 != ret)
                {
                    /* Give back the socketInUse mutex. */
                    wifi_give_mutex(MUTEX_TX);
                    return WIFI_ERR_CHANGE_SOCKET;
                }
            }
        }
        if (1 == g_use_uart_num)
        {
            if (0 == g_wifi_transparent_mode)
            {
                wifi_give_mutex(MUTEX_TX);
                if (0 != wifi_take_mutex(MUTEX_TX | MUTEX_RX))
                {
                    return WIFI_ERR_TAKE_MUTEX;
                }
                ret = wifi_change_transparent_mode();
                wifi_give_mutex(MUTEX_RX);
                if (0 != ret)
                {
                    /* Give back the socketInUse mutex. */
                    wifi_give_mutex(MUTEX_TX);
                    return WIFI_ERR_MODULE_COM;
                }
            }
        }

        if (0 != timeout_ms)
        {
            socket_timeout_init(socket_number, timeout_ms, 0);
        }

        timeout = 0;

        while (sended_length < length)
        {
            if ((length - sended_length) > g_wifi_tx_busiz_data)
            {
                current_send_length = g_wifi_tx_busiz_data;
            }
            else
            {
                current_send_length = length - sended_length;
            }

            if (current_send_length > WIFI_SOCKET_SENDABLE_DATASIZE)
            {
                current_send_length = WIFI_SOCKET_SENDABLE_DATASIZE;
            }

            g_wifi_uart[g_data_port].tx_end_flag = 0;
            ercd = R_SCI_Send(g_wifi_uart[g_data_port].wifi_uart_sci_handle,
                    (uint8_t SCI_FAR*)data + sended_length, current_send_length); /* send */
            if (SCI_SUCCESS != ercd)
            {
                break;
            }

            while (1)
            {
                if (0 != g_wifi_uart[g_data_port].tx_end_flag)
                {
                    break;
                }
                vTaskDelay(1);
            }

            sended_length += current_send_length;
            if ((-1) == socket_check_timeout(socket_number, 0))
            {
                break;
            }
        }
        api_ret = sended_length;

        /* Give back the socketInUse mutex. */
        wifi_give_mutex(MUTEX_TX);
    }
    else
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_SendSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_ReceiveSocket
 * Description  : Receive data on connecting socket.
 * Arguments    : socket_number
 *                data
 *                length
 *                timeout_ms
 * Return Value : Positive number - number of received data
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_CHANGE_SOCKET
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
int32_t R_WIFI_SX_ULPGN_ReceiveSocket(int32_t socket_number, uint8_t * data, int32_t length, uint32_t timeout_ms)
{
    uint32_t recvcnt = 0;
    int32_t ret;
    byteq_err_t byteq_ret = BYTEQ_ERR_INVALID_ARG;
    int32_t api_ret = WIFI_ERR_TAKE_MUTEX;
    volatile int32_t timeout;

    if ((NULL == data) || (length <= 0))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0)
            || (0 == g_wifi_socket[socket_number].socket_create_flag)
            || (WIFI_SOCKET_STATUS_CONNECTED != g_wifi_socket[socket_number].socket_status))
    {
        return WIFI_ERR_SOCKET_NUM;
    }

    if (0 == wifi_take_mutex(MUTEX_RX))
    {
        do
        {
            taskENTER_CRITICAL();
            byteq_ret = R_BYTEQ_Get(g_wifi_socket[socket_number].socket_byteq_hdl, (data + recvcnt));
#if defined(__CCRL__) || defined(__ICCRL__) || defined (__RL)
            uint16_t byteq_free = 0;
            R_BYTEQ_Unused (g_wifi_socket[socket_number].socket_byteq_hdl, &byteq_free);

