jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
            if (WIFI_CFG_SOCKETS_RECEIVE_BUFFER_THRESHOLD < byteq_free)
            {
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
            }
#endif
            taskEXIT_CRITICAL();
            if(byteq_ret == BYTEQ_SUCCESS)
            {
                recvcnt++;
                g_wifi_socket[socket_number].extracted_data_size++;
            }
        }
        while((byteq_ret == BYTEQ_SUCCESS) && (recvcnt < length));

        if (recvcnt >= length)
        {
            api_ret = recvcnt;
            wifi_give_mutex(MUTEX_RX);
            return api_ret;
        }
        if (2 == g_use_uart_num)
        {
            if (socket_number != g_current_socket_index)
            {
                if (0 != wifi_take_atc_mutex(MUTEX_TX | MUTEX_RX))
                {
                    return WIFI_ERR_TAKE_MUTEX;
                }
                ret = wifi_change_socket_index((uint8_t)socket_number); /* socket index */
                wifi_give_atc_mutex(MUTEX_TX | MUTEX_RX);
                if (0 != ret)
                {
                    /* Give back the socketInUse mutex. */
                    wifi_give_mutex(MUTEX_RX);
                    return WIFI_ERR_CHANGE_SOCKET;
                }
            }
        }
        if (1 == g_use_uart_num)
        {
            if (0 == g_wifi_transparent_mode)
            {
                if (0 != wifi_take_mutex(MUTEX_TX))
                {
                    wifi_give_mutex(MUTEX_RX);
                    return WIFI_ERR_TAKE_MUTEX;
                }
                ret = wifi_change_transparent_mode();
                wifi_give_mutex(MUTEX_TX);
                if (0 != ret)
                {
                    /* Give back the socketInUse mutex. */
                    wifi_give_mutex(MUTEX_RX);
                    return WIFI_ERR_MODULE_COM;

                }
            }
        }
        if ((0 != timeout_ms) && (portMAX_DELAY != timeout_ms))
        {
            socket_timeout_init(socket_number, timeout_ms, 1);
        }

        while (1)
        {
            taskENTER_CRITICAL();
            byteq_ret = R_BYTEQ_Get(g_wifi_socket[socket_number].socket_byteq_hdl, (data + recvcnt));
            taskEXIT_CRITICAL();
#if defined(__CCRL__) || defined(__ICCRL__) || defined (__RL)
            uint16_t byteq_free = 0;
            R_BYTEQ_Unused (g_wifi_socket[socket_number].socket_byteq_hdl, &byteq_free);

            if (WIFI_CFG_SOCKETS_RECEIVE_BUFFER_THRESHOLD < byteq_free)
            {
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
            }
#endif
            if (BYTEQ_SUCCESS == byteq_ret)
            {
                recvcnt++;
                g_wifi_socket[socket_number].extracted_data_size++;
                if (recvcnt >= length)
                {
                    break;
                }
                continue;
            }
            if (WIFI_SOCKET_STATUS_CONNECTED != g_wifi_socket[socket_number].socket_status)
            {
                break;
            }
            if (WIFI_SYSTEM_CONNECT != g_wifi_system_state)
            {
                break;
            }
            if ((0 != timeout_ms) && (portMAX_DELAY != timeout_ms))
            {
                if ((-1) == socket_check_timeout(socket_number, 1))
                {
#if DEBUGLOG == 1
                    R_BSP_CpuInterruptLevelWrite (13);
                    R_BSP_CpuInterruptLevelWrite (0);
#endif
                    if (0 == recvcnt)
                    {
                        g_wifi_socket[socket_number].timeout_count++;
                        if (g_wifi_socket[socket_number].timeout_count >= ULPGN_CFG_SOCKET_STATUS_CHECK_FREQUENCY)
                        {
                            ret = wifi_get_socket_status(socket_number);
                            if (ULPGN_SOCKET_STATUS_CONNECTED != ret)
                            {
                                wifi_give_mutex(MUTEX_RX);
                                R_WIFI_SX_ULPGN_CloseSocket(socket_number);
#if DEBUGLOG == 1
                                R_BSP_CpuInterruptLevelWrite (13);
                                printf("Socket_%d is not connected\r\n", socket_number);
                                R_BSP_CpuInterruptLevelWrite (0);
#endif
                            }
                            g_wifi_socket[socket_number].timeout_count = 0;
                        }
                    }
                    else
                    {
                        g_wifi_socket[socket_number].timeout_count = 0;
                    }

                    break;
                }
            }
            vTaskDelay(1);
        }

        /* socket is not closed, and recieve data size is 0. */
        /* Give back the socketInUse mutex. */
        api_ret = recvcnt;
        wifi_give_mutex(MUTEX_RX);
#if DEBUGLOG == 1
        tmptime2 = xTaskGetTickCount();
        R_BSP_CpuInterruptLevelWrite (13);
        printf("r:%06d:tcp %ld byte received.reqsize=%ld,%x\r\n", tmptime2, recvcnt, length, (uint32_t)pdata);
        R_BSP_CpuInterruptLevelWrite (0);
#endif

    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_ReceiveSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_ShutdownSocket
 * Description  : Shutdown connecting socket.
 * Arguments    : socket_number
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_CHANGE_SOCKET
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_ShutdownSocket(int32_t socket_number)
{
    wifi_err_t api_ret = WIFI_SUCCESS;
    int32_t subroutain_ret;

