jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) ||
            (0 == g_wifi_socket[socket_number].socket_create_flag)
            || (g_wifi_socket[socket_number].socket_status <= WIFI_SOCKET_STATUS_SOCKET))
    {
        return WIFI_ERR_SOCKET_NUM;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        if (2 == g_use_uart_num)
        {
            subroutain_ret = wifi_change_socket_index((uint8_t)socket_number); /* socket index */
            if (0 != subroutain_ret)
            {
                api_ret = WIFI_ERR_CHANGE_SOCKET;
            }
        }
        if (1 == g_use_uart_num)
        {
            wifi_change_command_mode();
        }
    }
    if (WIFI_SUCCESS == api_ret)
    {
        subroutain_ret = wifi_execute_at_command(g_atcmd_port, "ATNCLOSE\r", g_atcmd_timeout1,
                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_number);
        if (0 != subroutain_ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
        else
        {
            g_wifi_socket[socket_number].socket_status = WIFI_SOCKET_STATUS_SOCKET;
            vTaskDelay(500);
        }
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_ShutdownSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_CloseSocket
 * Description  : Disconnect connecting socket.
 * Arguments    : socket_number
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_CHANGE_SOCKET
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_CloseSocket(int32_t socket_number)
{
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t mutex_flag;
    uint8_t i;
    uint8_t reset_flg = 0;

    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0))
    {
        return WIFI_ERR_SOCKET_NUM;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }

    if (WIFI_SUCCESS == api_ret)
    {
        if (1 == g_wifi_socket[socket_number].socket_create_flag)
        {
            if (g_wifi_socket[socket_number].socket_status > WIFI_SOCKET_STATUS_SOCKET)
            {
                api_ret = R_WIFI_SX_ULPGN_ShutdownSocket(socket_number);
            }
            R_BYTEQ_Flush(g_wifi_socket[socket_number].socket_byteq_hdl);
            g_wifi_socket[socket_number].ipversion = 0;
            g_wifi_socket[socket_number].protocol = 0;
            g_wifi_socket[socket_number].ssl_flag = 0;
            g_wifi_socket[socket_number].ssl_type = 0;
            g_wifi_socket[socket_number].ssl_certificate_id = 0;
            g_wifi_socket[socket_number].socket_status = WIFI_SOCKET_STATUS_CLOSED;
            g_wifi_socket[socket_number].socket_create_flag = 0;
            g_wifi_socket[socket_number].timeout_count = 0;
            g_wifi_socket[socket_number].extracted_data_size = 0;
            g_wifi_socket[socket_number].total_data_size = 0;
            g_wifi_socket[socket_number].processed_data_size = 0;
            g_wifi_socket[socket_number].start_processed_data_size = 0;
            g_wifi_socket[socket_number].end_processed_data_size = 0;
        }
        for (i = 0; i < WIFI_CFG_CREATABLE_SOCKETS; i++)
        {
            if(g_wifi_socket[i].socket_status > WIFI_SOCKET_STATUS_CLOSED)
            {
                reset_flg = 0;
                break;
            }
            else
            {
                reset_flg = 1;
            }
        }
        if(1 == reset_flg)
        {
            g_current_socket_index = 0;
            g_before_socket_index = 0;
        }
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        /* Give back the socketInUse mutex. */
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_CloseSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_DnsQuery
 * Description  : Execute DNS query.
 * Arguments    : domain_name
 *                ip_address
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_DnsQuery(uint8_t SCI_FAR * domain_name, uint32_t * ip_address)
{
    int32_t func_ret;
    uint8_t mutex_flag;
    wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == domain_name) || (NULL == ip_address))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        g_wifi_dnsquery_subcount = 0;

        /* AT command */
        sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNDNSQUERY=%s\r", domain_name);
        func_ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                g_atcmd_timeout4, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNSQUERY, 0xff);
        if (0 != func_ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
        else
        {
            *ip_address = g_wifi_dnsaddress;
        }
    }
    if (WIFI_ERR_TAKE_MUTEX != api_ret)
    {
        wifi_give_mutex(mutex_flag);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_DnsQuery
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_Ping
 * Description  : Execute Ping command.
 * Arguments    : ip_address
 *                count
 *                interval_ms
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_NOT_CONNECT
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_Ping(uint32_t ip_address, uint16_t count, uint32_t interval_ms)
{
    int32_t func_ret;
    uint8_t mutex_flag;
    uint32_t i;
    wifi_err_t api_ret = WIFI_SUCCESS;
    uint32_t success_count;

    if ((0 == ip_address) || (0 == count))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_CONNECT;
    }
    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

