jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SUCCESS == api_ret)
    {
        success_count = 0;
        for (i = 0; i < count; i++ )
        {
            mutex_flag = (MUTEX_TX | MUTEX_RX);
            if (0 != wifi_take_mutex(mutex_flag))
            {
                api_ret = WIFI_ERR_TAKE_MUTEX;
            }
            if (WIFI_SUCCESS == api_ret)
            {
                /* AT command */
                sprintf((char *) g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNPING=%d.%d.%d.%d\r",
                        WIFI_ULONG_TO_IPV4BYTE_1(ip_address), /* addr1 */
                        WIFI_ULONG_TO_IPV4BYTE_2(ip_address), /* addr2 */
                        WIFI_ULONG_TO_IPV4BYTE_3(ip_address), /* addr3 */
                        WIFI_ULONG_TO_IPV4BYTE_4(ip_address)); /* addr4 */
                func_ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        g_atcmd_timeout3, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_PING, 0xff);
                if (0 != func_ret)
                {
                }
                else
                {
                    success_count++;
                }
            }
            if (WIFI_ERR_TAKE_MUTEX != api_ret)
            {
                wifi_give_mutex(mutex_flag);
            }
            if ((i + 1) < count)
            {
                vTaskDelay(interval_ms);
            }
        }
    }
    if (0 == success_count)
    {
        if (WIFI_ERR_TAKE_MUTEX != api_ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
        }
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_Ping
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_GetVersion
 * Description  : Get FIT module version.
 * Arguments    : none.
 * Return Value : FIT module version
 *********************************************************************************************************************/
uint32_t R_WIFI_SX_ULPGN_GetVersion(void)
{
    /* These version macros are defined in r_wifi_sx_ulpgn_if.h. */
    return ((((uint32_t) WIFI_SX_ULPGN_CFG_VERSION_MAJOR) << 16) | (uint32_t) WIFI_SX_ULPGN_CFG_VERSION_MINOR);
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_GetVersion
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_get_ipaddress
 * Description  : Get IP address.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_get_ipaddress(void)
{
    int32_t func_ret;

    func_ret = wifi_execute_at_command(g_atcmd_port, "ATNSET=\?\r",
            g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_IPADDRESS, 0xff);
    if (0 != func_ret)
    {
        return -1;
    }
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_get_ipaddress
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_get_socket_status
 * Description  : Get socket status.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_get_socket_status(uint8_t socket_number)
{
    int32_t ret;

    ret = wifi_execute_at_command(g_atcmd_port, "ATNSTAT\r",
            g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
            WIFI_COMMAND_GET_SOCKET_STATUS, socket_number);
    if (0 != ret)
    {
        return -1;
    }

    if (g_wifi_socket_status < ULPGN_SOCKET_STATUS_MAX)
    {
        return g_wifi_socket_status;
    }
    else
    {
        return -1;
    }
}
/**********************************************************************************************************************
 * End of function wifi_get_ipaddress
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_change_transparent_mode
 * Description  : change to transparent mode.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_change_transparent_mode(void)
{
    int32_t ret;

    if ((1 == g_use_uart_num) && (0 == g_wifi_transparent_mode))
    {
        ret = wifi_execute_at_command(g_atcmd_port, "ATO\r",
                g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_SET_TRANSPARENT_MODE, 0xff);
        if (0 != ret)
        {
            return -1;
        }
        else
        {
            g_wifi_transparent_mode = 1;
        }
    }
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_change_transparent_mode
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_change_command_mode
 * Description  : change to command mode.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_change_command_mode(void)
{
    int32_t ret;
    if ((1 == g_use_uart_num) && (1 == g_wifi_transparent_mode))
    {
        vTaskDelay(202);
        g_wifi_transparent_mode = 0;
        ret = wifi_execute_at_command(g_atcmd_port, "+++",
                g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_SET_COMMAND_MODE, 0xff);
        if (0 == ret)
        {
            vTaskDelay(202);
        }
        else
        {
            return -1;
        }
    }
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_change_command_mode
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_change_socket_index
 * Description  : change socket index.
 * Arguments    : socket_number
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_change_socket_index(uint8_t socket_number)
{
    uint8_t sequence = 0;
    int32_t ret = 0;
    uint32_t atustat_recv;

