jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    uint8_t zero_cnt = 0;
    uint32_t previous_atustat_sent;


    if (2 == g_use_uart_num)
    {
        if (socket_number != g_current_socket_index)
        {
            g_before_socket_index = g_current_socket_index;

            /* AT command */
            sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSOCKINDEX=%d\r", socket_number);
            while (sequence < 0x80)
            {
                switch (sequence)
                {
                    case 0:
                        if (0 != wifi_check_uart_state( &atustat_recv, &previous_atustat_sent))
                        {
                            ret = -1;
                            sequence = 0x80;
                            break;
                        }
                        if(g_wifi_socket[g_before_socket_index].end_processed_data_size == previous_atustat_sent)
                        {
                            zero_cnt++;
                        }
                        else
                        {
                            g_wifi_socket[g_before_socket_index].end_processed_data_size = previous_atustat_sent;
                            zero_cnt = 0;
                        }

                        if(ULPGN_CFG_SOCKET_CHANGE_ATUSTAT_RETRY_COUNT <= zero_cnt ||
                          (g_wifi_socket[g_before_socket_index].total_data_size +
                           g_wifi_socket[g_before_socket_index].end_processed_data_size -
                           g_wifi_socket[g_before_socket_index].start_processed_data_size -
                           g_wifi_socket[g_before_socket_index].extracted_data_size) > ULPGN_CFG_SOCKET_CHANGE_BUFFER_SIZE)
                        {
                            sequence = 1;
                        }
                        else
                        {
                            R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_ATUSTAT_RETRY_TIME,
                                                ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
                        }

                        break;
                    case 1:
                        /* RTS_ON */
                        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
                        vTaskDelay(ULPGN_CFG_SOCKET_CHANGE_BEFORE_WAIT);

                        if (0 != wifi_check_uart_state( &atustat_recv,
                            &g_wifi_socket[g_before_socket_index].end_processed_data_size))
                        {
                            ret = -1;
                            sequence = 0x80;
                            break;
                        }
                        /* Send ATNSOCKINDEX command. */
                        ret = wifi_execute_at_command(g_atcmd_port,
                                g_wifi_uart[g_atcmd_port].p_cmdbuf,
                                g_atcmd_timeout1,
                                WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CHANGE,
                                socket_number);

                        /* Parse command return code. */
                        switch (ret)
                        {
                            case 0:/* change socket index to next. */
                                g_current_socket_index = socket_number;
                                g_wifi_socket[g_before_socket_index].total_data_size +=
                                        g_wifi_socket[g_before_socket_index].end_processed_data_size -
                                            g_wifi_socket[g_before_socket_index].start_processed_data_size;
                                g_wifi_socket[g_current_socket_index].start_processed_data_size =
                                		g_wifi_socket[g_before_socket_index].end_processed_data_size;

                                g_wifi_socket[g_current_socket_index].processed_data_size = 0;

                                /* RTS_OFF */
                                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
                                sequence = 0x80;
                                break;

                            case -1: /* Communication with module failed. */
                                sequence = 0x80;
                                break;

                            case -2: /* BUSY */
                                /* If dont change socket because of wifi module busy,
                                 * retry change socket command. */
                                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;

                                /* Wait for module to complete send data. */
                                vTaskDelay(g_wifi_uart[g_data_port].socket_change_delay_time);
                                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;

                                sequence = 1;
                                break;

                            default:/* This is command error and recovery socket status. */
                                ret = -1;
                                sequence = 0x80;
                                break;
                        }
                        break;
                    default:
                        break;
                }
            }
            WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
        }
    }

    return ret;
}
/**********************************************************************************************************************
 * End of function wifi_change_socket_index
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_check_uart_state
 * Description  : check uart state.
 * Arguments    : uart_receive_status
 *                uart_send_status
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_check_uart_state(uint32_t * uart_receive_status, uint32_t * uart_send_status)
{
#if DEBUGLOG == 1
    TickType_t tmptime1, tmptime2;
#endif

    uint8_t retry_count;
    int32_t ret;

    for (retry_count = 0; retry_count < 10; retry_count++ )
    {
        ret = wifi_execute_at_command(g_atcmd_port, "ATUSTAT\r", g_atcmd_timeout1, WIFI_RETURN_ENUM_OK,
                WIFI_COMMAND_GET_SENT_RECV_SIZE, 0xff);
        if (0 == ret)
        {
            *uart_receive_status = g_wifi_atustat_recv;
            *uart_send_status = g_wifi_atustat_sent;
            return 0;
        }
        if ((-1) == ret)
        {
            return -1;
        }
        if ((-2) == ret)
        {
            continue;
        }
    }
    return -1;
}
/**********************************************************************************************************************
 * End of function wifi_check_uart_state
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_open_for_initial
 * Description  : Open serial port for initial.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_serial_open_for_initial(void)
{
    sci_err_t my_sci_err;

