jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PINSET_FUNC_DEFAULT();
#endif

    memset(&g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.baud_rate = WIFI_UART_BAUDRATE_DEFAULT;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.clk_src = SCI_CLK_INT;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.data_size = SCI_DATA_8BIT;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_en = SCI_PARITY_OFF;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_type = SCI_EVEN_PARITY;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.stop_bits = SCI_STOPBITS_1;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;

    my_sci_err = R_SCI_Open(SCI_CH_WIFI_DEFAULT, SCI_MODE_ASYNC,
            &g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config,
            wifi_uart_callback_default_port_for_inititial,
            &g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle);
    if (SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

    return 0;

}
/**********************************************************************************************************************
 * End of function wifi_serial_open_for_initial
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_open_for_data
 * Description  : Open serial port for data.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_serial_open_for_data(void)
{
    sci_err_t my_sci_err;
    uint8_t level;

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PINSET_FUNC_DEFAULT();
#endif

    memset(&g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.baud_rate = WIFI_CFG_SCI_BAUDRATE;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.clk_src = SCI_CLK_INT;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.data_size = SCI_DATA_8BIT;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.parity_en = SCI_PARITY_OFF;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.parity_type = SCI_EVEN_PARITY;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.stop_bits = SCI_STOPBITS_1;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;

    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].socket_change_delay_time =
        ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE * ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD / (WIFI_CFG_SCI_BAUDRATE / 8);

    my_sci_err = R_SCI_Open(SCI_CH_WIFI_DEFAULT, SCI_MODE_ASYNC,
            &g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config,
            wifi_uart_callback_default_port_for_data,
            &g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle);

    if (SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    level = g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.int_priority - 1;
    my_sci_err = R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle,
            SCI_CMD_SET_TXI_PRIORITY, &level);
    if (SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }
#endif

    return 0;

}
/**********************************************************************************************************************
 * End of function wifi_serial_open_for_data
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_second_port_open
 * Description  : Open serial port for secondary.
 * Arguments    : none.
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_serial_second_port_open(void)
{
    sci_err_t my_sci_err;

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PINSET_FUNC_SECOND();
#endif

    memset(&g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.baud_rate = 115200;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.clk_src = SCI_CLK_INT;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.data_size = SCI_DATA_8BIT;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.parity_en = SCI_PARITY_OFF;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.parity_type = SCI_EVEN_PARITY;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.stop_bits = SCI_STOPBITS_1;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;

    my_sci_err = R_SCI_Open(SCI_CH_WIFI_SECOND, SCI_MODE_ASYNC,
            &g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config,
            wifi_uart_callback_second_port_for_command,
            &g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle);

    if (SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_serial_second_port_open
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_close
 * Description  : Close serial port.
 * Arguments    : none.
 * Return Value : 0  - success
 *********************************************************************************************************************/
static int32_t wifi_serial_close(void)
{
    wifi_serial_default_port_close();
    if (2 == g_use_uart_num)
    {
        wifi_serial_second_port_close();
    }
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_serial_close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_default_port_close
 * Description  : Close serial default port.
 * Arguments    : none.
 * Return Value : 0  - success
 *********************************************************************************************************************/
static int32_t wifi_serial_default_port_close(void)
{
    R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_RX_Q_FLUSH, NULL);
    R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_TX_Q_FLUSH, NULL);
    R_SCI_Close(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle);
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_serial_default_port_close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_serial_second_port_close
 * Description  : Close serial default port.
 * Arguments    : none.
 * Return Value : 0  - success
 *********************************************************************************************************************/
static int32_t wifi_serial_second_port_close(void)
{
    R_SCI_Control(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, SCI_CMD_RX_Q_FLUSH, NULL);
    R_SCI_Control(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, SCI_CMD_TX_Q_FLUSH, NULL);
    R_SCI_Close(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle);
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_serial_second_port_close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_uart_callback_default_port_for_inititial
 * Description  : SCI callback function of serial default port.
 * Arguments    : pArgs
 * Return Value : none.
 *********************************************************************************************************************/
static void wifi_uart_callback_default_port_for_inititial(void * pArgs)
{
    sci_cb_args_t * p_args;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* callback event */
    p_args = (sci_cb_args_t*) pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_wifi_uart[ULPGN_UART_DEFAULT_PORT].tx_end_flag = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
         You will need to increase buffer size or reduce baud rate */
        g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }
    vTaskNotifyGiveFromISR(g_wifi_recv_task_handle, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken); /* RTOS ISR */

