jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
}
/**********************************************************************************************************************
 * End of function wifi_uart_callback_default_port_for_inititial
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_uart_callback_second_port_for_command
 * Description  : SCI callback function of serial secondary port.
 * Arguments    : pArgs
 * Return Value : none.
 *********************************************************************************************************************/
static void wifi_uart_callback_second_port_for_command(void * pArgs)
{
    sci_cb_args_t * p_args;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* callback event */
    p_args = (sci_cb_args_t*) pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_wifi_uart[ULPGN_UART_SECOND_PORT].tx_end_flag = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
         You will need to increase buffer size or reduce baud rate */
        g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }
    vTaskNotifyGiveFromISR(g_wifi_recv_task_handle, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken); /* RTOS ISR */

}
/**********************************************************************************************************************
 * End of function wifi_uart_callback_second_port_for_command
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_uart_callback_default_port_for_data
 * Description  : SCI callback function of serial data port.
 * Arguments    : pArgs
 * Return Value : none.
 *********************************************************************************************************************/
static void wifi_uart_callback_default_port_for_data(void * pArgs)
{
    sci_cb_args_t * p_args;
    byteq_err_t byteq_ret;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* callback event */
    p_args = (sci_cb_args_t*) pArgs;

    if (SCI_EVT_RX_CHAR == p_args->event)
    {
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
        if (g_wifi_socket[g_before_socket_index].socket_status == WIFI_SOCKET_STATUS_CONNECTED)
        {
            uint16_t byteq_free = 0;
            R_BYTEQ_Unused (g_wifi_socket[g_before_socket_index].socket_byteq_hdl, &byteq_free);
            if (WIFI_CFG_SOCKETS_RECEIVE_BUFFER_THRESHOLD >= byteq_free)
            {
                WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
            }
        }
#endif
        R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_RX_Q_FLUSH, NULL);
        if ((g_wifi_socket[g_before_socket_index].socket_create_flag == 1)
                && (0 != g_wifi_socket[g_before_socket_index].end_processed_data_size
                            - g_wifi_socket[g_before_socket_index].start_processed_data_size
                                - g_wifi_socket[g_before_socket_index].processed_data_size))
        {
            byteq_ret = R_BYTEQ_Put(g_wifi_socket[g_before_socket_index].socket_byteq_hdl, p_args->byte);
            if (BYTEQ_SUCCESS != byteq_ret)
            {
                g_wifi_socket[g_before_socket_index].put_error_count++;
            }
            g_wifi_socket[g_before_socket_index].processed_data_size++;
        }
        else if (g_wifi_socket[g_current_socket_index].socket_create_flag == 1)
        {
            byteq_ret = R_BYTEQ_Put(g_wifi_socket[g_current_socket_index].socket_byteq_hdl, p_args->byte);
            if (BYTEQ_SUCCESS != byteq_ret)
            {
                g_wifi_socket[g_current_socket_index].put_error_count++;
            }
            g_wifi_socket[g_current_socket_index].processed_data_size++;
        }
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_wifi_uart[ULPGN_UART_DEFAULT_PORT].tx_end_flag = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
         You will need to increase buffer size or reduce baud rate */
        g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }
    vTaskNotifyGiveFromISR(g_wifi_recv_task_handle, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken); /* RTOS ISR */

