jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
}
/**********************************************************************************************************************
 * End of function wifi_uart_callback_default_port_for_data
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_execute_at_command
 * Description  : Execute AT command.
 * Arguments    : serial_ch_id
 *                p_cmdstr
 *                timeout_ms
 *                expect_code
 *                command
 *                socket_number
 * Return Value : ATCMD_OK      - success
 *                ATCMD_TIMEOUT - timeout
 *                ATCMD_BUSY    - busy
 *********************************************************************************************************************/
static int32_t wifi_execute_at_command(uint8_t serial_ch_id, const uint8_t SCI_FAR * ptextstring,
        uint16_t timeout_ms, wifi_return_code_t expect_code, wifi_command_list_t command, int32_t socket_number)
{
    volatile int32_t timeout;
    sci_err_t ercd;
    int8_t get_queue;
    uint32_t recvcnt = 0;
    int32_t ret;
    wifi_return_code_t result;
    uint32_t ticket_no;


    timeout_init(serial_ch_id, timeout_ms);

    if (NULL != ptextstring)
    {
        timeout = 0;
        recvcnt = 0;
#if DEBUGLOG == 2
        R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL-1);
        printf("%s\r\n",ptextstring);
        R_BSP_CpuInterruptLevelWrite (0);
#endif

        ticket_no = wifi_set_request_in_queue(command, socket_number);
        g_wifi_uart[serial_ch_id].tx_end_flag = 0;

        /* AT command */
        ercd = R_SCI_Send(g_wifi_uart[serial_ch_id].wifi_uart_sci_handle, (uint8_t SCI_FAR *)ptextstring,
                strlen((const char *)ptextstring)); /* textstring size */
        if (SCI_SUCCESS != ercd)
        {
            return -1;

        }

        while (1)
        {
            if (0 != g_wifi_uart[serial_ch_id].tx_end_flag)
            {
                break;
            }

            /* check timeout */
            if ((-1) == check_timeout((uint32_t) serial_ch_id, recvcnt))
            {
                wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_INTERNAL_TIMEOUT);
                timeout = 1;
                break;
            }
            vTaskDelay(1);
        }
        if (1 == timeout)
        {
            return -1;
        }
    }
    else
    {
        ticket_no = wifi_set_request_in_queue(command, socket_number);
    }
    while (1)
    {
        get_queue = wifi_get_result_from_queue(ticket_no, &result);
        if (0 == get_queue)
        {
            break;
        }

        /* check timeout */
        if ((-1) == check_timeout((uint32_t)serial_ch_id, recvcnt))
        {
            wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_INTERNAL_TIMEOUT);
            timeout = 1;
            break;
        }
        vTaskDelay(1);
    }
    if (1 == timeout)
    {
        return -1;
    }

    ret = -1;
    if (result == expect_code)
    {
        ret = 0;
    }
    else if (WIFI_RETURN_ENUM_BUSY == result)
    {
        ret = -2;
    }
    else
    {
        ; /* Do nothing */
    }
    return ret;
}
/**********************************************************************************************************************
 * End of function wifi_execute_at_command
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: timeout_init
 * Description  : initialize timeout counter.
 * Arguments    : serial_ch
 *                timeout_ms
 * Return Value : none.
 *********************************************************************************************************************/
static void timeout_init(int32_t serial_ch, uint16_t timeout_ms)
{
    st_atcmd_info_t * p_uart;
    p_uart = &g_wifi_uart[serial_ch];

    p_uart->starttime = xTaskGetTickCount();
    p_uart->endtime = p_uart->starttime + timeout_ms;
    if (p_uart->endtime < p_uart->starttime)
    {
        /* endtime value is overflow */
        p_uart->timeout_overflow_flag = 1;
    }
    else
    {
        p_uart->timeout_overflow_flag = 0;
    }
}
/**********************************************************************************************************************
 * End of function timeout_init
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: check_timeout
 * Description  : Check timeout occurred.
 * Arguments    : serial_ch
 *                rcvcount
 * Return Value : 0  - timeout not occurred
 *                -1 - timeout occurred
 *********************************************************************************************************************/
static int32_t check_timeout(int32_t serial_ch, int32_t rcvcount)
{
    st_atcmd_info_t * p_uart;
    p_uart = &g_wifi_uart[serial_ch];

    if (0 == rcvcount)
    {
        p_uart->thistime = xTaskGetTickCount();
        if (0 == p_uart->timeout_overflow_flag)
        {
            if ((p_uart->thistime >= p_uart->endtime) || (p_uart->thistime < p_uart->starttime))
            {
                /* Timeout  */
                return -1;
            }
        }
        else
        {
            if ((p_uart->thistime < p_uart->starttime) && (p_uart->thistime >= p_uart->endtime))
            {
                /* Timeout  */
                return -1;
            }
        }
    }

    /* Not timeout  */
    return 0;
}
/**********************************************************************************************************************
 * End of function check_timeout
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: socket_timeout_init
 * Description  : .
 * Arguments    : socket_number
 *                timeout_ms
 *                flag
 * Return Value : none.
 *********************************************************************************************************************/
static void socket_timeout_init(uint8_t socket_number, uint32_t timeout_ms, uint8_t flag)
{
    TickType_t * p_starttime;
    TickType_t * p_endtime;
    uint8_t * p_timeout_overflow_flag;

    wifi_socket_t * p_socket;
    p_socket = &g_wifi_socket[socket_number];

    if (0 == flag)
    {
        p_starttime = &p_socket->send_starttime;
        p_endtime = &p_socket->send_endtime;
        p_timeout_overflow_flag = &p_socket->send_timeout_overflow_flag;
    }
    else
    {
        p_starttime = &p_socket->recv_starttime;
        p_endtime = &p_socket->recv_endtime;
        p_timeout_overflow_flag = &p_socket->recv_timeout_overflow_flag;
    }
    *p_starttime = xTaskGetTickCount();
    *p_endtime = (*p_starttime) + timeout_ms;
    if ((*p_endtime) < (*p_starttime))
    {
        /* overflow */
        *p_timeout_overflow_flag = 1;
    }
    else
    {
        *p_timeout_overflow_flag = 0;
    }
}
/**********************************************************************************************************************
 * End of function socket_timeout_init
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: socket_check_timeout
 * Description  : Check timeout occurred on connecting socket.
 * Arguments    : socket_number
 *                flag
 * Return Value : 0  - timeout not occurred
 *                -1 - timeout occurred
 *********************************************************************************************************************/
static int32_t socket_check_timeout(uint8_t socket_number, uint8_t flag)
{
    TickType_t * p_starttime;
    TickType_t * p_thistime;
    TickType_t * p_endtime;
    uint8_t * p_timeout_overflow_flag;
    wifi_socket_t * p_socket;

    p_socket = &g_wifi_socket[socket_number];
    if (0 == flag)
    {
        p_starttime = &p_socket->send_starttime;
        p_thistime = &p_socket->send_thistime;
        p_endtime = &p_socket->send_endtime;
        p_timeout_overflow_flag = &p_socket->send_timeout_overflow_flag;
    }
    else
    {
        p_starttime = &p_socket->recv_starttime;
        p_thistime = &p_socket->recv_thistime;
        p_endtime = &p_socket->recv_endtime;
        p_timeout_overflow_flag = &p_socket->recv_timeout_overflow_flag;
    }

    *p_thistime = xTaskGetTickCount();
    if (0 == (*p_timeout_overflow_flag))
    {
        if (((*p_thistime) >= (*p_endtime)) || ((*p_thistime) < (*p_starttime)))
        {
            return -1;
        }
    }
    else
    {
        if (((*p_thistime) < (*p_starttime)) && ((*p_thistime) <= (*p_endtime)))
        {
            return -1;
        }
    }

    /* Not timeout  */
    return 0;
}
/**********************************************************************************************************************
 * End of function socket_check_timeout
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_take_mutex
 * Description  : Take mutex for WiFi module.
 * Arguments    : mutex_flag
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_take_mutex(uint8_t mutex_flag)
{
    if (0 != (mutex_flag & MUTEX_TX))
    {
        if (pdTRUE != xSemaphoreTake(s_wifi_tx_semaphore, s_xMaxSemaphoreBlockTime))
        {
            return -1;
        }
    }

    if (0 != (mutex_flag & MUTEX_RX))
    {
        if (pdTRUE != xSemaphoreTake(s_wifi_rx_semaphore, s_xMaxSemaphoreBlockTime))
        {
            if (0 != (mutex_flag & MUTEX_TX))
            {
                /* tx semaphore */
                xSemaphoreGive(s_wifi_tx_semaphore);
            }
            return -1;
        }
    }
#if DEBUGLOG ==2
    printf("Semaphore Get\n\n");
#endif
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_take_mutex
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_take_atc_mutex
 * Description  : Take mutex for WiFi module.
 * Arguments    : mutex_flag
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static int32_t wifi_take_atc_mutex(uint8_t mutex_flag)
{
    if (0 != (mutex_flag & MUTEX_TX))
    {
        if (pdTRUE != xSemaphoreTake(s_wifi_atc_tx_semaphore, s_xMaxSemaphoreBlockTime))
        {
            return -1;
        }
    }

    if (0 != (mutex_flag & MUTEX_RX))
    {
        if (pdTRUE != xSemaphoreTake(s_wifi_atc_rx_semaphore, s_xMaxSemaphoreBlockTime))
        {
            if (0 != (mutex_flag & MUTEX_TX))
            {
                /* tx semaphore */
                xSemaphoreGive(s_wifi_atc_tx_semaphore);
            }
            return -1;
        }
    }
#if DEBUGLOG ==2
    printf("Semaphore Get\n\n");
#endif
    return 0;
}
/**********************************************************************************************************************
 * End of function wifi_take_atc_mutex
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_give_mutex
 * Description  : Give mutex for WiFi module.
 * Arguments    : mutex_flag
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static void wifi_give_mutex(uint8_t mutex_flag)
{
    if (0 != (mutex_flag & MUTEX_RX))
    {
        /* rx semaphore */
        xSemaphoreGive(s_wifi_rx_semaphore);
        vTaskDelay(1);
    }
    if (0 != (mutex_flag & MUTEX_TX))
    {
        /* tx semaphore */
        xSemaphoreGive(s_wifi_tx_semaphore);
        vTaskDelay(1);
    }
#if DEBUGLOG ==2
    printf("Semaphore Give\r\n");
#endif
    return;
}
/**********************************************************************************************************************
 * End of function wifi_give_mutex
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_give_atc_mutex
 * Description  : Give mutex for WiFi module.
 * Arguments    : mutex_flag
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
static void wifi_give_atc_mutex(uint8_t mutex_flag)
{
    if (0 != (mutex_flag & MUTEX_RX))
    {
        /* rx semaphore */
        xSemaphoreGive(s_wifi_atc_rx_semaphore);
        vTaskDelay(1);
    }
    if (0 != (mutex_flag & MUTEX_TX))
    {
        /* tx semaphore */
        xSemaphoreGive(s_wifi_atc_tx_semaphore);
        vTaskDelay(1);
    }
#if DEBUGLOG ==2
    printf("Semaphore Give\r\n");
#endif
    return;
}
/**********************************************************************************************************************
 * End of function wifi_give_atc_mutex
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_RegistServerCertificate
 * Description  : Register server certificate on WiFi module.
 * Arguments    : data_id
 *                datatype
 *                pdata
 *                length
 *                timeout_ms
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_RegistServerCertificate(uint32_t data_id, uint32_t datatype,
        const uint8_t * pdata, int32_t length, uint32_t timeout_ms)
{
    volatile int32_t timeout;
    volatile int32_t sended_length;
    int32_t current_send_length;
    wifi_err_t api_ret = WIFI_SUCCESS;
    sci_err_t ercd;
    int8_t get_queue;
    wifi_return_code_t result;
    uint8_t mutex_flag;
    uint32_t ticket_no;

    if ((NULL == pdata) || (length < 0))
    {
        return WIFI_ERR_PARAMETER;
    }
    if (datatype >= 2)
    {
        return WIFI_ERR_PARAMETER;
    }

