jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }

    mutex_flag = MUTEX_TX | MUTEX_RX;
    if (0 == wifi_take_mutex(mutex_flag))
    {
        sended_length = 0;

        switch (datatype)
        {
            case 0x00: /* RootCA */
                sprintf((char *) g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        "ATNSSLCERT=calist%d.crt,%d\r", (uint8_t)data_id, length);
                break;
            case 0x01: /* Certificate & Key */
                sprintf((char *) g_wifi_uart[g_atcmd_port].p_cmdbuf,
                        "ATNSSLCERT=cert%d.crt,%d\r", (uint8_t)data_id, length);
                break;
            default:
                break;
        }
        wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                g_atcmd_timeout2, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_WRITE_DATA, 0xff);

        timeout_init(g_atcmd_port, 2000);
        ticket_no = wifi_set_request_in_queue(WIFI_COMMAND_SET_SYSFALSH_WRITE_DATA, 0xff);
        g_wifi_uart[g_atcmd_port].tx_end_flag = 0;

        while (sended_length < length)
        {
            if ((length - sended_length) > g_wifi_tx_busiz_command)
            {
                current_send_length = g_wifi_tx_busiz_command;
            }
            else
            {
                current_send_length = length - sended_length;
            }
            timeout = 0;

            /* data send */
            ercd = R_SCI_Send(g_wifi_uart[g_atcmd_port].wifi_uart_sci_handle, (uint8_t SCI_FAR*) pdata + sended_length,
                    current_send_length);
            if (SCI_SUCCESS != ercd)
            {
                break;
            }

            while (1)
            {
                if (0 != g_wifi_uart[g_atcmd_port].tx_end_flag)
                {
                    break;
                }
                vTaskDelay(1);
            }
            sended_length += current_send_length;
        }
        while (1)
        {
            get_queue = wifi_get_result_from_queue(ticket_no, &result);
            if (0 == get_queue)
            {
                break;
            }

            if ((-1) == check_timeout(g_atcmd_port, 0))
            {
                timeout = 1;
                break;
            }
            vTaskDelay(1);
        }
        if (1 == timeout)
        {
            wifi_give_mutex(mutex_flag);
            return WIFI_ERR_MODULE_COM;
        }
        if (WIFI_RETURN_ENUM_OK != result)
        {
            wifi_give_mutex(mutex_flag);
            return WIFI_ERR_MODULE_COM;
        }

        /* Give back the socketInUse mutex. */
        wifi_give_mutex(mutex_flag);
    }
    else
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_RegistServerCertificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_RequestTlsSocket
 * Description  : Request TLS socket communication.
 * Arguments    : socket_number
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_SOCKET_NUM
 *                WIFI_ERR_NOT_CONNECT
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_RequestTlsSocket(int32_t socket_number)
{
    wifi_err_t api_ret = WIFI_SUCCESS;

    if (0 != R_WIFI_SX_ULPGN_IsConnected())
    {
        return WIFI_ERR_NOT_CONNECT;
    }

    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) ||
            (WIFI_SOCKET_STATUS_SOCKET != g_wifi_socket[socket_number].socket_status) ||
            (WIFI_SOCKET_IP_PROTOCOL_TCP != g_wifi_socket[socket_number].protocol))
    {
        api_ret = WIFI_ERR_SOCKET_NUM;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        api_ret = wifi_setsslconfiguration(socket_number, 0);
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_RequestTlsSocket
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_setsslconfiguration
 * Description  : Set TLS socket configuration.
 * Arguments    : socket_number
 *                ssl_type
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_SOCKET_NUM
 *********************************************************************************************************************/
static wifi_err_t wifi_setsslconfiguration(int32_t socket_number, uint8_t ssl_type)
{
    wifi_err_t api_ret = WIFI_SUCCESS;

    if ((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) || (ssl_type > 3) ||
            (WIFI_SOCKET_STATUS_SOCKET != g_wifi_socket[socket_number].socket_status) ||
            (WIFI_SOCKET_IP_PROTOCOL_TCP != g_wifi_socket[socket_number].protocol))
    {
        return WIFI_ERR_SOCKET_NUM;
    }

    g_wifi_socket[socket_number].ssl_flag = 1;
    g_wifi_socket[socket_number].ssl_type = ssl_type;

    return api_ret;
}
/**********************************************************************************************************************
 * End of function wifi_setsslconfiguration
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: erase_certificate
 * Description  : Erase certificate on WiFi module.
 * Arguments    : certificate_name
 * Return Value : 0  - success
 *                -1 - timeout
 *                -2 - busy
 *********************************************************************************************************************/
static uint32_t erase_certificate(uint8_t * certificate_name)
{
    int32_t ret;

    /* erase */
    sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLCERT=%s,0\r", (char *)certificate_name);
    ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf, 1000,
            WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_ERASE_DATA, 0xff);

    return ret;
}
/**********************************************************************************************************************
 * End of function erase_certificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_EraseServerCertificate
 * Description  : Erase server certificate on WiFi module.
 * Arguments    : certificate_name
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_EraseServerCertificate(uint8_t * certificate_name)
{
    wifi_err_t api_ret = WIFI_SUCCESS;
    int32_t ret;
    uint8_t mutex_flag;
    uint8_t certificate_flg = 0;
    wifi_certificate_infomation_t * p_cert_info;
    wifi_certificate_infomation_t cert_info;
    p_cert_info = (wifi_certificate_infomation_t *) &cert_info; /* cert info */

