jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }

    if (0 == certificate_name)
    {
        return WIFI_ERR_PARAMETER;
    }

    ret = R_WIFI_SX_ULPGN_GetServerCertificate(p_cert_info);
    if (0 != ret)
    {
        return (wifi_err_t)ret; /* cast */
    }

    mutex_flag = MUTEX_TX | MUTEX_RX;
    if (0 == wifi_take_mutex(mutex_flag))
    {
        /* Exist certificate file */
        while (0 != p_cert_info->certificate_file[0])
        {
            /* certificate name Comparison */
            if (0 == strcmp((char *)(p_cert_info->certificate_file), (char *)certificate_name))
            {
                certificate_flg = 1;
                break;
            }
            p_cert_info = p_cert_info->next_certificate_name;
        }

        if (0 == certificate_flg)
        {
            wifi_give_mutex(mutex_flag);
            return WIFI_ERR_PARAMETER;
        }

        /* erase certificate */
        ret = (wifi_err_t)erase_certificate(certificate_name);
        if (0 != ret)
        {
            api_ret = WIRI_ERR_FLASH_ERASE;
            wifi_give_mutex(mutex_flag);
            return api_ret;
        }

        /* Give back the socketInUse mutex. */
        wifi_give_mutex(mutex_flag);
    }
    else
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_EraseServerCertificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_GetServerCertificate
 * Description  : Get stored server certificate on WiFi module.
 * Arguments    : wifi_certificate_information
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_GetServerCertificate(wifi_certificate_infomation_t * wifi_certificate_information)
{
    wifi_err_t api_ret = WIFI_SUCCESS;
    int32_t ret;
    uint8_t mutex_flag;
    wifi_certificate_infomation_t * p_cert_info;

    if (NULL == wifi_certificate_information)
    {
        return WIFI_ERR_PARAMETER;
    }

    p_cert_info = g_wifi_certificate_information;

    /* Clear Current Certificate Information */
    while (0 != p_cert_info->certificate_file[0])
    {
        memset(&p_cert_info->certificate_file, 0, sizeof(p_cert_info->certificate_file));
        p_cert_info = p_cert_info->next_certificate_name;
    }
    g_wifi_certificate_information[0].certificate_number = 0;

    api_ret = WIFI_SUCCESS;
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        memcpy(wifi_certificate_information, &g_wifi_certificate_information[0], sizeof(wifi_certificate_infomation_t));
        return WIFI_ERR_NOT_OPEN;
    }

    mutex_flag = MUTEX_TX | MUTEX_RX;
    if (0 != wifi_take_mutex(mutex_flag))
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
        return api_ret;
    }
    if (WIFI_SUCCESS == api_ret)
    {
        /* AT command */
        sprintf((char *)g_wifi_uart[g_atcmd_port].p_cmdbuf, "ATNSSLCERT=?\r");
        ret = wifi_execute_at_command(g_atcmd_port, g_wifi_uart[g_atcmd_port].p_cmdbuf,
                g_atcmd_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_READ_DATA, 0xff);

        if (WIFI_SUCCESS != ret)
        {
            api_ret = WIFI_ERR_MODULE_COM;
#if DEBUGLOG == 2
            printf("COMMAND DOES NOT SUCCESS\r\n");
#endif
        }
        else if (1 != g_certificate_list_flg)
        {
            api_ret = WIRI_ERR_FLASH_READ;
#if DEBUGLOG == 2
            printf("Get the Certificate information was Fail\r\n");
#endif
        }
        else
        {
            api_ret = WIFI_SUCCESS;
        }

        /* Give back the socketInUse mutex. */
        wifi_give_mutex(mutex_flag);
    }
    else
    {
        api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    memcpy(wifi_certificate_information, &g_wifi_certificate_information[0], sizeof(wifi_certificate_infomation_t));
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_GetServerCertificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_WriteServerCertificate
 * Description  : Write server certificate on WiFi module.
 * Arguments    : data_id
 *                data_type
 *                certificate
 *                certificate_length
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_PARAMETER
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_WriteServerCertificate(uint32_t data_id, uint32_t data_type,
        const uint8_t * certificate, uint32_t certificate_length)
{
    wifi_err_t api_ret;
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }
    if ((NULL == certificate) || (certificate_length <= 0))
    {
        return WIFI_ERR_PARAMETER;
    }
    api_ret = R_WIFI_SX_ULPGN_RegistServerCertificate(data_id, data_type, certificate, certificate_length, 0);
    return api_ret;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_WriteServerCertificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_EraseAllServerCertificate
 * Description  : Erase all stored server certificate on WiFi module.
 * Arguments    : none
 * Return Value : WIFI_SUCCESS
 *                WIFI_ERR_NOT_OPEN
 *                WIFI_ERR_TAKE_MUTEX
 *                WIFI_ERR_MODULE_COM
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_EraseAllServerCertificate(void)
{
    wifi_err_t api_ret;
    uint8_t retry_no;
    wifi_certificate_infomation_t * p_cert_info;
    wifi_certificate_infomation_t cert_info;
    p_cert_info = (wifi_certificate_infomation_t*) &cert_info; /* cert info */

