jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    if (WIFI_SYSTEM_CLOSE == g_wifi_system_state)
    {
        return WIFI_ERR_NOT_OPEN;
    }
    api_ret = R_WIFI_SX_ULPGN_GetServerCertificate(p_cert_info);
    if (0 != api_ret)
    {
        return api_ret;
    }
    if (0 == p_cert_info->certificate_number)
    {
        /* Certificate File is nothing */
        return WIFI_SUCCESS;
    }
    while (0 != p_cert_info->certificate_file[0])
    {
        /* erase certificate */
        api_ret = (wifi_err_t)erase_certificate(p_cert_info->certificate_file);
        if (WIFI_SUCCESS != api_ret)
        {
            for (retry_no = 0; retry_no < 3; retry_no++ )
            {
                /* retry */
                api_ret = (wifi_err_t)erase_certificate(p_cert_info->certificate_file);
                if (WIFI_SUCCESS == api_ret)
                {
                    break;
                }
            }
            if (WIFI_SUCCESS != api_ret)
            {
                return WIRI_ERR_FLASH_ERASE;
            }
        }
        p_cert_info = p_cert_info->next_certificate_name;
    }
    return WIFI_SUCCESS;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_EraseAllServerCertificate
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_WIFI_SX_ULPGN_SetCertificateProfile
 * Description  : Associate server information to certificate.
 * Arguments    : certificate_id
 *                ip_address
 *                server_name
 * Return Value : WIFI_SUCCESS
 *********************************************************************************************************************/
wifi_err_t R_WIFI_SX_ULPGN_SetCertificateProfile(uint8_t certificate_id, uint32_t ip_address, const char * server_name)
{
    if ('\0' == *server_name)
    {
        memset(g_cert_profile[certificate_id].host_name, 0, sizeof(g_cert_profile[certificate_id].host_name));
    }
    else
    {
        strcpy(g_cert_profile[certificate_id].host_name, server_name);
    }
    g_cert_profile[certificate_id].host_address = ip_address;
    g_cert_profile[certificate_id].cert_id = certificate_id;
    return WIFI_SUCCESS;
}
/**********************************************************************************************************************
 * End of function R_WIFI_SX_ULPGN_SetCertificateProfile
 *********************************************************************************************************************/
